"""

abc = 69
deef = "lol"
efn = '123564654eeef'

input()
print()

for i in <список или range>:
    тело

while условие:
    тело

if условие:
    если да
else 
    если нет

def название_функции(параметр, необязательный_параметр = 67):
    тело

"""


"""
Задание

Напишите программу, которая в последовательности натуральных десятичных чисел
определяет среднее арифметическое элементов, запись которых в системе счисления 
с основанием 7 оканчивается нечетной цифрой. Если среди входных данных 
таких элементов нет, программа должна вывести «NO».

Программа получает на вход в первой строке натуральное  — количество чисел N
 (3 ≤ N ≤ 10 000), затем N натуральных чисел, не превышающих 30 000, 
 каждое в отдельной строке.

Программа должна вывести одно число  — среднее арифметическое десятичных
 чисел (элементов последовательности), запись которых 7-ричной системе 
 счисления оканчивается нечетной цифрой, или «NO», если среди входных данных 
 таких элементов нет.

 
"""


"""
Функция для перевода из 10ной системы счисления в 7ную
"""
def перевести(число):
    результат = ""

    while число > 7:
        результат += str(число % 7) + результат
        число //= 7
    
    return int(str(число) + результат)

"""
Функция проверяет, оканчивается ли число нечётной цифрой
True - если нечётной
False - если чётной
"""
def нечётное(число):
    return число % 10 % 2 != 0

def решение():
    N = int(input())
    ср_арифм = []

    for _ in range(0, N):
        тек_числ = int(input())
        г = перевести(тек_числ)
        if нечётное(г):
            ср_арифм.append(тек_числ)

    if len(ср_арифм) > 0:
        print(sum(ср_арифм) / len(ср_арифм))
    else:
        print("NO")

if __name__ == "__main__":
    решение()

